In [1]:
import pandas as pd

In [2]:
file_path = "/workspaces/tir103/data-pipeline/resource/dtype_sample.csv"
df = pd.read_csv(file_path)
df

,Name,Experience,Age,Department,DepartmentID,CreatedDatetime,CreatedDatetimeTZ,Remote,OnBoard,Intern
0,John Doe,10.0,35,Engineering,1,2023-04-05T14:30,2023-04-05T14:30+08:00,True,V,0
1,Jane Smith,NaN,29,Marketing,2,2023-02-28T08:15,2023-02-28T08:15+08:00,False,X,0
2,Emily Davis,2.0,27,Product,3,2023-03-15T12:45,2023-03-15T12:45+08:00,True,V,0
3,Mark Evans,5.0,30,Sales,4,2023-01-13T09:00,2023-01-13T09:00+08:00,False,V,1

In [3]:
df.dtypes

Name                  object
Experience           float64
Age                    int64
Department            object
DepartmentID           int64
CreatedDatetime       object
CreatedDatetimeTZ     object
Remote                  bool
OnBoard               object
Intern                 int64
dtype: object

In [4]:
columns_type = {
    "DepartmentID": "str",
}

df = pd.read_csv(file_path, dtype=columns_type)
df

,Name,Experience,Age,Department,DepartmentID,CreatedDatetime,CreatedDatetimeTZ,Remote,OnBoard,Intern
0,John Doe,10.0,35,Engineering,001,2023-04-05T14:30,2023-04-05T14:30+08:00,True,V,0
1,Jane Smith,NaN,29,Marketing,002,2023-02-28T08:15,2023-02-28T08:15+08:00,False,X,0
2,Emily Davis,2.0,27,Product,003,2023-03-15T12:45,2023-03-15T12:45+08:00,True,V,0
3,Mark Evans,5.0,30,Sales,004,2023-01-13T09:00,2023-01-13T09:00+08:00,False,V,1

In [5]:
df.dtypes

Name                  object
Experience           float64
Age                    int64
Department            object
DepartmentID          object
CreatedDatetime       object
CreatedDatetimeTZ     object
Remote                  bool
OnBoard               object
Intern                 int64
dtype: object

In [10]:
columns_type = {
    "DepartmentID": "str",
    "Remote": bool,
    "OnBoard": str,
    "Intern": bool,
}

df = pd.read_csv(file_path, dtype=columns_type)
df

,Name,Experience,Age,Department,DepartmentID,CreatedDatetime,CreatedDatetimeTZ,Remote,OnBoard,Intern
0,John Doe,10.0,35,Engineering,001,2023-04-05T14:30,2023-04-05T14:30+08:00,True,V,False
1,Jane Smith,NaN,29,Marketing,002,2023-02-28T08:15,2023-02-28T08:15+08:00,False,X,False
2,Emily Davis,2.0,27,Product,003,2023-03-15T12:45,2023-03-15T12:45+08:00,True,V,False
3,Mark Evans,5.0,30,Sales,004,2023-01-13T09:00,2023-01-13T09:00+08:00,False,V,True

In [11]:
df["OnBoard"].str.strip()

0    V
1    X
2    V
3    V
Name: OnBoard, dtype: object

In [14]:
df["OnBoard"].str.replace("V", "True").str.replace("X", "False")

0     True
1    False
2     True
3     True
Name: OnBoard, dtype: object

In [17]:
df["OnBoard"].str.replace("V", "True").str.replace("X", "False").astype(bool)

0    True
1    True
2    True
3    True
Name: OnBoard, dtype: bool

In [18]:
if "False":
    print(123)

123

In [19]:
if "":
    print(123)

In [21]:
df["OnBoard"].str.replace("V", "1").str.replace("X", "0").astype(int).astype(bool)

0     True
1    False
2     True
3     True
Name: OnBoard, dtype: bool

In [22]:
import numpy as np

np.where(
    df["OnBoard"] == "V",
    True,
    False,
)

array([ True, False,  True,  True])

In [23]:
df["OnBoard"] = np.where(
    df["OnBoard"] == "V",
    True,
    False,
)

In [24]:
df

,Name,Experience,Age,Department,DepartmentID,CreatedDatetime,CreatedDatetimeTZ,Remote,OnBoard,Intern
0,John Doe,10.0,35,Engineering,001,2023-04-05T14:30,2023-04-05T14:30+08:00,True,True,False
1,Jane Smith,NaN,29,Marketing,002,2023-02-28T08:15,2023-02-28T08:15+08:00,False,False,False
2,Emily Davis,2.0,27,Product,003,2023-03-15T12:45,2023-03-15T12:45+08:00,True,True,False
3,Mark Evans,5.0,30,Sales,004,2023-01-13T09:00,2023-01-13T09:00+08:00,False,True,True

In [26]:
columns_type = {
    "DepartmentID": "str",
    "Remote": bool,
    "OnBoard": str,
    "Intern": bool,
    # "CreatedDatetime": "datetime64[ns]",
    "CreatedDatetime": str,
}

df = pd.read_csv(file_path, dtype=columns_type)
df

,Name,Experience,Age,Department,DepartmentID,CreatedDatetime,CreatedDatetimeTZ,Remote,OnBoard,Intern
0,John Doe,10.0,35,Engineering,001,2023-04-05T14:30,2023-04-05T14:30+08:00,True,V,False
1,Jane Smith,NaN,29,Marketing,002,2023-02-28T08:15,2023-02-28T08:15+08:00,False,X,False
2,Emily Davis,2.0,27,Product,003,2023-03-15T12:45,2023-03-15T12:45+08:00,True,V,False
3,Mark Evans,5.0,30,Sales,004,2023-01-13T09:00,2023-01-13T09:00+08:00,False,V,True

In [27]:
df["CreatedDatetime"].apply(pd.to_datetime)

0   2023-04-05 14:30:00
1   2023-02-28 08:15:00
2   2023-03-15 12:45:00
3   2023-01-13 09:00:00
Name: CreatedDatetime, dtype: datetime64[ns]

In [28]:
pd.to_datetime(df["CreatedDatetime"])

0   2023-04-05 14:30:00
1   2023-02-28 08:15:00
2   2023-03-15 12:45:00
3   2023-01-13 09:00:00
Name: CreatedDatetime, dtype: datetime64[ns]

In [29]:
pd.to_datetime(df["CreatedDatetimeTZ"])

0   2023-04-05 14:30:00+08:00
1   2023-02-28 08:15:00+08:00
2   2023-03-15 12:45:00+08:00
3   2023-01-13 09:00:00+08:00
Name: CreatedDatetimeTZ, dtype: datetime64[ns, UTC+08:00]